//** @file
//   Strings for CPU Information DXE
//
//;******************************************************************************
//;* Copyright (c) 2020, Insyde Software Corp. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************

/=#

#include "Standard.uni"

#string STR_BLANK_STRING                                         #language en-US " "

#string STR_CPU_INFO_FORMSET                                     #language en-US "CPU Information"
#string STR_CPU_INFO_FORMSET_HELP                                #language en-US "CPU Information"

#string STR_NUMBER_OF_CPU_INSTALLED_STRING                       #language en-US "  0 CPU Installed"
#string STR_CPU_STRING                                           #language en-US "CPU"
#string STR_CPUS_STRING                                          #language en-US "CPUs"
#string STR_INSTALLED_STRING                                     #language en-US "Installed"
#string STR_INDEX_OF_CPU_STRING                                  #language en-US "Socket"

#string STR_PROCESSOR_VERSION_PROMPT                             #language en-US "Processor Version"
#string STR_CPUID_PROMPT                                         #language en-US "CPUID"
#string STR_CPU_SPEED_PROMPT                                     #language en-US "CPU Speed"
#string STR_CPU_TDP_PROMPT                                       #language en-US "CPU TDP"
#string STR_CPU_VOLTAGE_PROMPT                                   #language en-US "CPU Voltage"
#string STR_CPU_STEPPING_PROMPT                                  #language en-US "CPU Stepping"
#string STR_DATA_CACHE_PROMPT                                    #language en-US "L1 Data Cache (Per Core)"
#string STR_INSTRUCTION_CACHE_PROMPT                             #language en-US "L1 Instruction Cache (Per Core)"
#string STR_L2_CACHE_PROMPT                                      #language en-US "L2 Cache (Per Core)"
#string STR_L3_CACHE_PROMPT                                      #language en-US "L3 Cache (Per Socket)"
#string STR_NUM_OF_CORE_THREAD_PROMPT                            #language en-US "Number Of Processors"
#string STR_MICROCODE_PATCH_LEVEL_PROMPT                         #language en-US "Microcode Patch Level"

#string STR_PROCESSOR_VERSION_TEXT                               #language en-US "N/A"
#string STR_CPUID_TEXT                                           #language en-US "N/A"
#string STR_CPU_SPEED_TEXT                                       #language en-US "N/A"
#string STR_CPU_TDP_TEXT                                         #language en-US "N/A"
#string STR_CPU_VOLTAGE_TEXT                                     #language en-US "N/A"
#string STR_CPU_STEPPING_TEXT                                    #language en-US "N/A"
#string STR_DATA_CACHE_TEXT                                      #language en-US "N/A"
#string STR_INSTRUCTION_CACHE_TEXT                               #language en-US "N/A"
#string STR_L2_CACHE_TEXT                                        #language en-US "N/A"
#string STR_L3_CACHE_TEXT                                        #language en-US "N/A"
#string STR_NUM_OF_CORE_THREAD_TEXT                              #language en-US "N/A"
#string STR_MICROCODE_PATCH_LEVEL_TEXT                           #language en-US "N/A"

#string STR_PROCESSOR_VERSION_HELP                               #language en-US "The processor version.\n"
#string STR_CPUID_HELP                                           #language en-US "Raw processor identification data."
#string STR_CPU_SPEED_HELP                                       #language en-US "Current processor speed (in MHz) supported by the system for this processor socket."
#string STR_CPU_TDP_HELP                                         #language en-US "The maximum amount of heat generated by a computer chip or component (often a CPU, GPU or system on a chip) "
                                                                                 "that the cooling system in a computer is designed to dissipate under any workload."
#string STR_CPU_VOLTAGE_HELP                                     #language en-US "The amount of power a CPU uses, and thus the amount of heat it dissipates, is the product of this voltage and the current it draws."
#string STR_CPU_STEPPING_HELP                                    #language en-US "Raw processor identification data."
#string STR_DATA_CACHE_HELP                                      #language en-US "L1 (Level 1) cache is the fastest memory that is present in a computer system.\n"
                                                                                 "In terms of priority of access, L1 cache has the data the CPU is most likely to need while completing a certain task."
#string STR_INSTRUCTION_CACHE_HELP                               #language en-US "Cache type field."
#string STR_L2_CACHE_HELP                                        #language en-US "L2 (Level 2) cache is slower than L1 cache, but bigger in size.\n"
                                                                                 "Its size typically varies between 256KB to 8MB, although the newer, powerful CPUs tend to go past that.\n"
                                                                                 "L2 cache holds data that is likely to be accessed by the CPU next.\n"
                                                                                 "In most modern CPUs, the L1 and L2 caches are present on the CPU cores themselves, with each core getting its own cache."
#string STR_L3_CACHE_HELP                                        #language en-US "L3 (Level 3) cache is the largest cache memory unit, and also the slowest one.\n"
                                                                                 "It can range between 4MB to upwards of 50MB.\n"
                                                                                 "Modern CPUs have dedicated space on the CPU die for the L3 cache, and it takes up a large chunk of the space."
#string STR_NUM_OF_CORE_THREAD_HELP                              #language en-US "Number of enabled cores per processor socket.\n"
                                                                                 "Number of threads per processor socket."
#string STR_MICROCODE_PATCH_LEVEL_HELP                           #language en-US "Update microcode patch in current processor."
//
// End of file
//